In [2]:
import pandas as pd
import sqlite3

connection = sqlite3.connect("data/sql-murder-mystery.db")


cursor_bootcamp = connection.cursor()

def sql_query(query):

   
    cursor_bootcamp.execute(query)
    

    
    ans = cursor_bootcamp.fetchall()

    
    names = [description[0] for description in cursor_bootcamp.description]

    return pd.DataFrame(ans,columns=names)

In [ ]:
query = "select * from crime_scene_report where date = 20180115 AND type = 'murder'"#Primero vemos todos los asesinatos que coincidan con la fecha del asesinato
sql_query(query)

,date,type,description,city
0,20180115,murder,Life? Dont talk to me about life.,Albany
1,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
2,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [ ]:
query = "select * from interview where person_id = 16371" #Lo pasamos por la tabla entrevista 
sql_query(query)

   person_id                                         transcript
0      16371  I saw the murder happen, and I recognized the ...

In [ ]:
query = "select *, check_in_time/60,check_out_time/60 from get_fit_now_check_in where check_in_date = 20180109 "#Ahora el tiempo lo dividimos para pasarlo ha horas 
                                                                                                                #y vemos que los ultimos tres relustados son un poco raros
sql_query(query)

,membership_id,check_in_date,check_in_time,check_out_time,check_in_time/60,check_out_time/60
0,X0643,20180109,957,1164,15,19
1,UK1F2,20180109,344,518,5,8
2,XTE42,20180109,486,1124,8,18
3,1AE2H,20180109,461,944,7,15
4,6LSTG,20180109,399,515,6,8
5,7MWHJ,20180109,273,885,4,14
6,GE5Q8,20180109,367,959,6,15
7,48Z7A,20180109,1600,1730,26,28
8,48Z55,20180109,1530,1700,25,28
9,90081,20180109,1600,1700,26,28

In [ ]:
query = "select * from get_fit_now_member where id = '48Z55'"#Buscamos el primer resultado del los ultimos tres de la anterior query y lo insertamos en la tabla "solution"
sql_query(query)

      id  person_id           name  membership_start_date membership_status
0  48Z55      67318  Jeremy Bowers               20160101              gold

In [ ]:
query = "INSERT INTO solution VALUES (1, 'Jeremy Bowers')" #Aquí se inserta 
query

"INSERT INTO solution VALUES (1, 'Jeremy Bowers')"

In [ ]:
query = "SELECT value FROM solution" # Y vemos que efectivamente es el pero el reto sigue 
sql_query(query)

                                               value
0  Congrats, you found the murderer! But wait, th...

In [ ]:
query = "select * from person where name = 'Jeremy Bowers'" # Aquí veo el id
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

In [ ]:
query = "select * from interview where person_id = 67318"#Vemos la entrevista de Jeremy Bowers y lo que dice
sql_query(query)

   person_id                                         transcript
0      67318  I was hired by a woman with a lot of money. I ...

In [ ]:
query = "select * from drivers_license where car_make = 'Tesla' and car_model = 'Model S'" # Miramos las personas que coincidan con la descripción que da Jeremy Bowers   
sql_query(query)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,202298,68,66,green,red,female,500123,Tesla,Model S
1,291182,65,66,blue,red,female,08CM64,Tesla,Model S
2,467669,70,65,green,white,male,W528W7,Tesla,Model S
3,638311,72,63,amber,white,male,0M846T,Tesla,Model S
4,682231,51,80,green,grey,female,3Z0M62,Tesla,Model S
5,736081,79,69,brown,red,male,GCAQ6Y,Tesla,Model S
6,918773,48,65,black,red,female,917UU3,Tesla,Model S

In [ ]:
query = "select * from person where license_id = 202298" #La primera persona que coincide con la descrición
sql_query(query)

,id,name,license_id,address_number,address_street_name,ssn
0,99716,Miranda Priestly,202298,1883,Golden Ave,987756388

In [ ]:
query = "INSERT INTO solution VALUES (1, 'Miranda Priestly')"#La insertamos
query

"INSERT INTO solution VALUES (1, 'Miranda Priestly')"

In [ ]:
query = "SELECT value FROM solution" #Y vemos que efectivamente es ella es el verdadero cerebro del asesinato 
sql_query(query)

                                               value
0  Congrats, you found the murderer! But wait, th...